name: "ensemble_preprocess_infer"
platform: "ensemble"
max_batch_size: 32
input [
  {
    name: "raw_image"
    data_type: TYPE_UINT8
    dims: [ -1, -1, 3 ]
  }
]
output [
  {
    name: "classification"
    data_type: TYPE_FP32
    dims: [ 1000 ]
  }
]
ensemble_scheduling {
  step [
    {
      model_name: "preprocessing"
      model_version: -1
      input_map {
        key: "raw_input"
        value: "raw_image"
      }
      output_map {
        key: "preprocessed_output"
        value: "preprocessed_image"
      }
    },
    {
      model_name: "resnet50_tensorrt"
      model_version: -1
      input_map {
        key: "input__0"
        value: "preprocessed_image"
      }
      output_map {
        key: "output__0"
        value: "classification"
      }
    }
  ]
}